# Date regex: matches dates like 14/02/2021, 14.02.2021, or 14-02-2021
DATE_REGEX = r'\d{1,2}[./-]\d{1,2}[./-]\d{2,4}'

# Currency dictionary mapping
CURRENCIES = {
    'UAH': ['грн.', 'грн', 'гРН', 'uah', 'UAH'],
    'USD': ['дол.', 'дол', 'usd', 'USD'],
    'EUR': ['є', 'євро', 'євр.', 'eur', 'EUR']
}

# Keywords for metadata extraction
KEYWORDS = ['готівка', 'картка', 'сума', 'валюта']

# Dictionary of noise to filter out – you can add Ukrainian city names as needed
CLEAN_DICT = [
    'чек', 'фіскальний', 'офлайн', 'р-н', 'україна', 'вул.', 'вулиця',
    'бульвар', 'бул.', 'проспект', 'просп.', 'касир', 'каса', 'оплата',
    'едрпоу', 'нефіскальний', 'видача', 'на дату', 'платіжна', 'система',
    'оператор', 'шосе', 'бонус', 'балів', 'пропозиції', 'код транз.',
    'код авт.', 'покупець', 'тел',

    # Ukrainian cities
    'київ', 'харків', 'одеса', 'дніпро', 'донецьк', 'запоріжжя', 'львів',
    'кривий ріг', 'миколаїв', 'маріуполь', 'вінниця', 'луганськ', 'макіївка',
    'сімферополь', 'херсон', 'полтава', 'чернігів', 'черкаси', 'житомир',
    'суми', 'хмельницький', 'чернівці', 'ровно', 'івано-франківськ', 'тернопіль',
    'кропивницький', 'луцьк', 'ужгород', 'бердянськ', 'біла церква', 'бориспіль',
    'каменське', 'кременчук', 'мелітополь', 'нікополь', 'павлоград', 'севастополь',
    'ужгород', 'фастів'
]